<script>
  import Map from "./comps/Map.svelte";
  import MapMarker from "./comps/MapMarker.svelte";
  import Box from "./comps/Box.svelte";

  let boxes = [
    {name: 'FREEDOM',                     address: 'Казанская ул., 7',                                              time: ['12:00 ÷ 23:00'], locationYx: [59.93248219108256, 30.321764014896996], },
    {name: 'Grizzly Bar steaks & burgers',address: 'Невский пр., 96',                                               time: ['12:00 ÷ 23:00'], locationYx: [59.932124504378486, 30.354718675185385], },
    {name: 'Бар Дюны',                    address: 'Лиговский пр., 50 корпус 11',                                   time: ['18:00 ÷ 02:00'], locationYx: [59.924137883186994, 30.363230090236936], },
    {name: 'Брусницын',                   address: 'Кожевенная линия, 30',                                          time: ['10:00 ÷ 22:00'], locationYx: [59.922016285819915, 30.248771566173758], },
    {name: 'Вавилов лофт',                address: 'Кадетская лин. ВО, 5 корп. 2Д',                                 time: ['Круглосуточно'], locationYx: [59.943057, 30.291218], },
    {name: 'Двор Гостинки',               address: 'Садовая ул.17',                                                 time: ['12:00 ÷ 22:00'], locationYx: [59.93352694725059, 30.331207798993198], },
    {name: 'Лофт Проект Этажи',           address: 'Лиговский пр., 74',                                             time: ['09:00 ÷ 23:00'], locationYx: [59.92184663849837, 30.357018994126822], },
    {name: 'Новая Голландия',             address: 'наб. Адмиралтейского канала, 2/4',                              time: ['09:00 ÷ 22:00'], locationYx: [59.930006855750165, 30.28816535615648], },
    {name: 'Океанариум',                  address: 'ул. Марата, 86, ТРК Планета Нептун',                            time: ['10.00 ÷ 21.00'], locationYx: [59.91921306801925, 30.338401341399173], },
    {name: 'Подписные Издания',           address: 'Литейный пр., 57',                                              time: ['10:00 ÷ 22:00'], locationYx: [59.93490194323532, 30.348128573482377], },
    {name: 'Ресторан Teplo',              address: 'Большая Морская ул., 4',                                        time: ['09:00 ÷ 23:00'], locationYx: [59.939148848490476, 30.307651219827214], },
    {name: 'Ресторан Корюшка',            address: 'Петропавловская крепость, 3',                                   time: ['12:00 ÷ 01:00'], locationYx: [59.948276834445736, 30.311269670270036], },
    {name: 'Ресторан Ларисуваннухочу',    address: 'пр. Науки, 14, к. 1, лит. А',                                   time: ['11:00 ÷ 23:00'], locationYx: [60.012091824318354, 30.404065341359598], },
    {name: 'Ресторан Мансарда',           address: 'Почтамтская ул., 3',                                            time: ['12:00 ÷ 01:00'], locationYx: [59.93289197960234, 30.303853981201268], },
    {name: 'Ресторан Марчеллис',          address: 'ул. Одоевского, 34А',                                           time: ['11:00 ÷ 23:00'], locationYx: [59.94816476105795, 30.232888114412283], },
    {name: 'Рубинштейна 28',              address: 'ул. Рубинштейна, 28, Автомобильная стоянка',                    time: ['Круглосуточно'], locationYx: [59.928983, 30.344218], },
    {name: 'Севкабель порт',              address: 'Кожевенная линия, 40',                                          time: ['Круглосуточно'], locationYx: [59.924670839507506, 30.240791318575006], },
    {name: 'Третий кластер',              address: '8 ÷ я Советская ул., 4,',                                       time: ['Круглосуточно'], locationYx: [59.93811167392183, 30.370448562611426], },
    {name: 'Флигель',                     address: 'ул. Восстания, дом 24/27 В, Творческое пространство Флигель',   time: ['Круглосуточно'], locationYx: [59.93817039781056, 30.358813728853193], },
    {name: 'Красный октябрь',             address: 'Берсеневский переулок, 3/10',                                   time: ['Круглосуточно'], locationYx: [55.741371, 37.609400], },
    {name: 'метро Серпуховская',          address: 'Большая Серпуховская ул., 17с1',                                time: ['Круглосуточно'], locationYx: [55.726848, 37.625675], },
    {name: 'Сад культуры и отдыха им. Н.Э. Баумана',address: 'Старая Басманная ул., 15 а, стр 4',                   time: ['06:00 ÷ 00:00'], locationYx: [55.768941691936774, 37.65911901775079], },
  ]

  let defXy = [30.337637, 59.954248]
  let currentLocation = {locationXy: defXy, zoom: [10]}

</script>

<nav class="navbar navbar-dark bg-dark">
  <div class="container">
    <span class="navbar-brand mb-0 h1">Расположение будок Memopix</span>
    <a style="text-decoration: none" target="_blank" rel="noopener noreferrer" href="https://www.instagram.com/memopixspb/">
      <span class="navbar-brand mb-0 h1">
        <svg xmlns="http://www.w3.org/2000/svg" height="20" fill="currentColor" class="bi bi-instagram"
             viewBox="0 0 16 16">
          <path d="M8 0C5.829 0 5.556.01 4.703.048 3.85.088 3.269.222 2.76.42a3.917 3.917 0 0 0-1.417.923A3.927 3.927 0 0 0 .42 2.76C.222 3.268.087 3.85.048 4.7.01 5.555 0 5.827 0 8.001c0 2.172.01 2.444.048 3.297.04.852.174 1.433.372 1.942.205.526.478.972.923 1.417.444.445.89.719 1.416.923.51.198 1.09.333 1.942.372C5.555 15.99 5.827 16 8 16s2.444-.01 3.298-.048c.851-.04 1.434-.174 1.943-.372a3.916 3.916 0 0 0 1.416-.923c.445-.445.718-.891.923-1.417.197-.509.332-1.09.372-1.942C15.99 10.445 16 10.173 16 8s-.01-2.445-.048-3.299c-.04-.851-.175-1.433-.372-1.941a3.926 3.926 0 0 0-.923-1.417A3.911 3.911 0 0 0 13.24.42c-.51-.198-1.092-.333-1.943-.372C10.443.01 10.172 0 7.998 0h.003zm-.717 1.442h.718c2.136 0 2.389.007 3.232.046.78.035 1.204.166 1.486.275.373.145.64.319.92.599.28.28.453.546.598.92.11.281.24.705.275 1.485.039.843.047 1.096.047 3.231s-.008 2.389-.047 3.232c-.035.78-.166 1.203-.275 1.485a2.47 2.47 0 0 1-.599.919c-.28.28-.546.453-.92.598-.28.11-.704.24-1.485.276-.843.038-1.096.047-3.232.047s-2.39-.009-3.233-.047c-.78-.036-1.203-.166-1.485-.276a2.478 2.478 0 0 1-.92-.598 2.48 2.48 0 0 1-.6-.92c-.109-.281-.24-.705-.275-1.485-.038-.843-.046-1.096-.046-3.233 0-2.136.008-2.388.046-3.231.036-.78.166-1.204.276-1.486.145-.373.319-.64.599-.92.28-.28.546-.453.92-.598.282-.11.705-.24 1.485-.276.738-.034 1.024-.044 2.515-.045v.002zm4.988 1.328a.96.96 0 1 0 0 1.92.96.96 0 0 0 0-1.92zm-4.27 1.122a4.109 4.109 0 1 0 0 8.217 4.109 4.109 0 0 0 0-8.217zm0 1.441a2.667 2.667 0 1 1 0 5.334 2.667 2.667 0 0 1 0-5.334z"/>
        </svg>
        Instagram
      </span>
    </a>
  </div>
</nav>

<div class="container">
  <div class="row">

    <div class="col-xl-7 my-3" style="height: 60vh">
      <Map bind:currentLocation={currentLocation}>
        {#each boxes as box}
          <MapMarker {box}/>
        {/each}
      </Map>
    </div>

    <div class="col-xl-5 card-deck overflow-auto my-3" style="height: 80vh">

      {#each boxes as box}
        <Box {box} bind:currentLocation={currentLocation}/>
      {/each}

    </div>

  </div>
</div>

<div class="container">
  <footer class="d-flex flex-wrap justify-content-between align-items-center py-3 my-4 border-top">

    <div class="col-md-4 d-flex align-items-center">
      <span class="mb-3 mb-md-0 text-muted">© 2023 Memopix</span>
    </div>

    <div class="col-md-4 d-flex align-items-center">
      <a style="text-decoration: none" href="tel:+7 921 943 43 13">
        <span class="mx-3 mb-md-0 text-muted"><i class="fa fa-phone"></i> +7-921-943-43-13 </span>
      </a>
      <a style="text-decoration: none" href="mailto:info@memopix.ru">
        <span class="mx-3 mb-md-0 text-muted"><i class="fa fa-envelope"></i> info@memopix.ru </span>
      </a>
    </div>

    <ul class="nav col-md-4 justify-content-end list-unstyled d-flex">
      <li class="ms-3">
        <a class="text-muted" target="_blank" rel="noopener noreferrer" href="https://www.instagram.com/memopixspb/">
          <svg xmlns="http://www.w3.org/2000/svg" height="20" fill="currentColor" class="bi bi-instagram"
               viewBox="0 0 16 16">
            <path
                d="M8 0C5.829 0 5.556.01 4.703.048 3.85.088 3.269.222 2.76.42a3.917 3.917 0 0 0-1.417.923A3.927 3.927 0 0 0 .42 2.76C.222 3.268.087 3.85.048 4.7.01 5.555 0 5.827 0 8.001c0 2.172.01 2.444.048 3.297.04.852.174 1.433.372 1.942.205.526.478.972.923 1.417.444.445.89.719 1.416.923.51.198 1.09.333 1.942.372C5.555 15.99 5.827 16 8 16s2.444-.01 3.298-.048c.851-.04 1.434-.174 1.943-.372a3.916 3.916 0 0 0 1.416-.923c.445-.445.718-.891.923-1.417.197-.509.332-1.09.372-1.942C15.99 10.445 16 10.173 16 8s-.01-2.445-.048-3.299c-.04-.851-.175-1.433-.372-1.941a3.926 3.926 0 0 0-.923-1.417A3.911 3.911 0 0 0 13.24.42c-.51-.198-1.092-.333-1.943-.372C10.443.01 10.172 0 7.998 0h.003zm-.717 1.442h.718c2.136 0 2.389.007 3.232.046.78.035 1.204.166 1.486.275.373.145.64.319.92.599.28.28.453.546.598.92.11.281.24.705.275 1.485.039.843.047 1.096.047 3.231s-.008 2.389-.047 3.232c-.035.78-.166 1.203-.275 1.485a2.47 2.47 0 0 1-.599.919c-.28.28-.546.453-.92.598-.28.11-.704.24-1.485.276-.843.038-1.096.047-3.232.047s-2.39-.009-3.233-.047c-.78-.036-1.203-.166-1.485-.276a2.478 2.478 0 0 1-.92-.598 2.48 2.48 0 0 1-.6-.92c-.109-.281-.24-.705-.275-1.485-.038-.843-.046-1.096-.046-3.233 0-2.136.008-2.388.046-3.231.036-.78.166-1.204.276-1.486.145-.373.319-.64.599-.92.28-.28.546-.453.92-.598.282-.11.705-.24 1.485-.276.738-.034 1.024-.044 2.515-.045v.002zm4.988 1.328a.96.96 0 1 0 0 1.92.96.96 0 0 0 0-1.92zm-4.27 1.122a4.109 4.109 0 1 0 0 8.217 4.109 4.109 0 0 0 0-8.217zm0 1.441a2.667 2.667 0 1 1 0 5.334 2.667 2.667 0 0 1 0-5.334z"/>
          </svg>
        </a>
      </li>

      <li class="ms-3">
        <a class="text-muted" target="_blank" rel="noopener noreferrer" href="https://www.facebook.com/memopixspb">
          <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" fill="currentColor" class="bi bi-facebook"
               viewBox="0 0 16 16">
            <path
                d="M16 8.049c0-4.446-3.582-8.05-8-8.05C3.58 0-.002 3.603-.002 8.05c0 4.017 2.926 7.347 6.75 7.951v-5.625h-2.03V8.05H6.75V6.275c0-2.017 1.195-3.131 3.022-3.131.876 0 1.791.157 1.791.157v1.98h-1.009c-.993 0-1.303.621-1.303 1.258v1.51h2.218l-.354 2.326H9.25V16c3.824-.604 6.75-3.934 6.75-7.951z"/>
          </svg>
        </a>
      </li>

      <li class="ms-3">
        <a class="text-muted" target="_blank" rel="noopener noreferrer" href="https://vk.com/memopixspb">
          <i class="fa fa-vk" style="color: currentColor; font-size: 20px"></i>
        </a>
      </li>
    </ul>

  </footer>
</div>
